export const texts = {
  links: [
    {
      title: "Вратарская Академия",
      src: "https://xn--80aaaaahti1aoc1a6bcpn0uh.xn--p1ai/",
      logo: "goalkeeper_academy.png",
      description:
        "Разработал лендинг Вратарской Академии. На лендинге реализованы: карусели с карточками услуг, формы заявок (ключевое действие), навигация по логическим блокам лендинга, плавная анимация, оптимизированная загрузка видео, адаптивная Pixel Perfect верстка. ",
    },
    {
      title: "Промышленное строительство",
      src: "https://promstroy74.ru/",
      logo: "PromStroy.png",
      description:
        "Разработал лендинг для компании Промышленное строительство. На лендинге реализованы: формы заявок с привязкой к сервису Email JS, переключение между страницами через router, плавная анимация, интерактивная анимация-параллакс на чистом js/css, верстка Pixel Perfect, адаптивная верстка.",
    },
    {
      title: "Леддер",
      src: "https://ledder.ru/",
      logo: "ledder.png",
      description:
        "Прописывал JS скрипты в блоках Wordpress на данном сайте: карусели с товарами и раскрывающиеся информационные блоки.",
    },
    {
      title: "Трекер Задач",
      src: "https://lad-academy.ru/project-task-tracker",
      logo: "Tracker.png",
      description:
        "Совместно с командой разрабатывал сервис - Трекер задач на NextJS с использованием TypeScript. Прописал логику CRUD-операций с использованием библиотеки SWR, верстал страницы по Pixel Perfect. Создавал формы авторизации/регистрации. Реализовал механизм авторизации при помощи JWT.",
    },
    {
      title: "Game Store",
      src: "https://grevold.github.io/game_store/",
      logo: "Game_Store.png",
      description:
        "Разработал учебный проект интернет-магазина цифровых ключей игр. Добавил API в проект для взаимодействия с базой данных (создание новых товаров, загрузка изображений и т.д.). Настроил авторизацию и store-менеджер MobX. Pixel Perfect верстка. Запуск проекта и хостинг на git-hub-pages. Подключил проект к базе данных Firebase.",
    },
    {
      title: "Minimal Beats",
      src: "https://grevold.github.io/DrumPads/",
      logo: "Minimal_Beats.png",
      description: `Разработал приложение для создания музыки. Работа с аудио осуществляется через библиотеку Howler. На аудио-поток можно накладывать эффекты, которые в свою очередь тоже имеют гибкие настройки. Оптимизированная загрузка банков звуков с кешированием: использовал простейшую базу данных на сервисе Яндекса, в ручную настроил CORS и прописал заголовки.`,
    },
    {
      title: "School 21 Hack",
      src: "https://grevold.github.io/school21hack/",
      logo: "school_21.png",
      description:
        "Разработал сервис для решения логических задач для поступления в Школу 21 от Сбера. Данный сервис решает задачу на поиск самого длинного пути в графе.",
    },

    {
      title: "Spy",
      src: "https://grevold.github.io/spy/",
      logo: "Spy.png",
      description:
        "Разработал браузерную игру «Шпион». С точки зрения разработки эта игра интересна тем, что в ней есть логика рандома (когда случайным образом распределяются роли игроков), асинхронными операциями (таймером) и анимацией на js/css.",
    },
    {
      title: "QPICK",
      src: "https://grevold.github.io/qpic/",
      logo: "QPICK.png",
      description:
        "Разработал учебный проект, в котором реализована возможность добавления товаров в корзину. Настроил авторизацию и Store-менеджер Redux-Toolkit.",
    },
    {
      title: "Авторизация/Регистрация",
      src: "https://grevold.github.io/FrontCloudCamp/",
      description:
        "Разработал учебный проект, который представляет собой форму регистрац ии пользователя. Настроил авторизац ию и Store-менеджер Redux-Toolkit (включая асинхронные экшены). Работал с формами React-Hook-Form (описание схемы, валидация). Pixel Perfect верстка.",
    },
  ],
};
