export const texts = {
  links: [
    {
      title: "Трекер Задач",
      src: "https://lad-academy.ru/main",
      logo: "Tracker.png",
      description:
        "Разрабатывал сервис - Трекер задач на NextJS с использованием TypeScript. Работал с API, верстал страницы по Pixel Perfect. Создавал формы авторизации/регистрации. Реализовал механизм авторизации при помощи JWT.",
    },
    {
      title: "Промышленное строительство",
      src: "https://promstroy74.ru/",
      logo: "PromStroy.png",
      description:
        "Разрабатывал сайт для продвижения строительной компании и сбора заявок от поставщиков. Верстка по Pixel Perfect, адаптивная верстка, создание анимаций на css. Создание формы для сбора данных от посетителей сайта. Хостинг проекта и привязка к сервису EmailJS. На данном сайте создал трехмерную паралакс-анимацию, которая реагирует на движение курсора -  сделал на чистом  JS и CSS, без использования сторонних библиотек.",
    },
    {
      title: "Связь-Кабель",
      src: "https://grevold.github.io/SvyazCabel/#/",
      logo: "Svyaz_Kabel.png",
      description:
        "Разработал сайт для продвижения строительной компании и сбора заявок от клиентов. Верстка по Pixel Perfect, адаптивная верстка, создание анимаций на css. Создание формы для сбора данных от посетителей сайта. Хостинг проекта и привязка к сервису EmailJS. Использовал в проекте API Яндекс-карты для нанесения на карту выполненных строительных объектов.",
    },
    {
      title: "Game Store",
      src: "https://grevold.github.io/game_store/",
      logo: "Game_Store.png",
      description:
        "Разработал учебный проект интернет-магазина цифровых ключей игр. Добавил API в проект для взаимодействия с базой данных (создание новых товаров, загрузка изображений и т.д.). Настроил авторизацию и store-менеджер MobX. Pixel Perfect верстка. Запуск проекта и хостинг на git-hub-pages. Подключил проект к базе данных Firebase.",
    },
    {
      title: "Minimal Beats",
      src: "https://grevold.github.io/DrumPads/",
      logo: "Minimal_Beats.png",
      description: `Разработал приложение для создания музыки. Оно предназначено для планшетов и мобильных устройств, но есть и десктопная версия. Пользователю предоставляется возможность играть музыку, использовать несколько категорий инструментов и накладывать эффекты. Основной сложностью являлась производительность приложения - звук должен воспроизводиться без задержки, при нажатии на клавиши. Для решения этой проблемы была выбрана библиотека Howler для работы с аудио. Так же использовалась библиотека React-Div-100vh, что позволило сделать контейнер с клавишами адаптивным для всех видов устройств и даже для горизонтального положения экрана. Также использовалась библиотека Redux-Toolkit для настройки стора и ANTD для добавления элементов управления приложением.`,
    },

    {
      title: "Spy",
      src: "https://grevold.github.io/spy/",
      logo: "Spy.png",
      description:
        "Реализовал настольную игру «Шпион» в браузере. Данный проект интересен анимацией переворачивания карточек (на JS и CSS), а также асинхронными процессами. Распределение ролей между игроками происходит рандомно. После того, как роли распределены, начинается игра и запускается два таймера: первый - ведущий обратный отсчет, а второй - таймер, который за 10 секунд до конца первого запускает аудио-файл, сообщающий о завершении партии. Все данные об игре прописаны в глобальном сторе, который настроен с помощью Redux-Toolkit. Также реализована возможность настройки количества игроков и времени на партию.",
    },
    {
      title: "QPICK",
      src: "https://grevold.github.io/qpic/",
      logo: "QPICK.png",
      description:
        "Разработал учебный проект, в котором реализована возможность добавления товаров в корзину. Настроил авторизацию и Store-менеджер Redux-Toolkit.",
    },
    {
      title: "Авторизация/Регистрация",
      src: "https://grevold.github.io/FrontCloudCamp/",
      description:
        "Разработал учебный проект, который представляет собой форму регистрац ии пользователя. Настроил авторизац ию и Store-менеджер Redux-Toolkit (включая асинхронные экшены). Работал с формами React-Hook-Form (описание схемы, валидация). Pixel Perfect верстка.",
    },
  ],
};
